import print as print


def print_hi(name):
    # Use a breakpoint in the code line below to debug your script.
    print("----------------------------------")
    print("\t\t" f'Hi, {name}')  # Press Ctrl+F8 to toggle the breakpoint.
    print("----------------------------------")

    

if __name__ == '__main__':

    '''
    # การใช้ if .. จะทำงานทันที ถ้าเงื่อนไขเป็นจริง
    # การใช้ else .. จะทำงานก็ต่อเมื่อ เงื่อนไขใน if ไม่เป็นจริง
    # การใช้ elif .. ใช้สำหรับสร้างเงื่อนไขแบบหลายทางเลือก elif ต้องใช้หลังจากคำสั่ง if เสมอ.. จะมี else ได้ในเงื่อนไขสุดท้าย
    
    age = int(input("ป้อนอายุ : "))
    if age > 15:
        print("วัยรุ้น")
    elif age >= 20:
        print("วัยผู้ใหญ่")
    elif age >= 30:
         print("วัยทำงาน")
    '''


    # -------------------------------------------------------------------------------------------------------------------    


    '''
    # การหาเลข [คู่/ขี้] โดยการใช้ % โดยการ เอาเลขจำนวนนึง มาหาร เลขจำนวนนึง ผมออกมาได้เศษ 0 มั้ย .. ถ้าไม่ได้ แปลว่าหารไม่ลงตัว นันคือเลขขี้
    number = int(input("ป้อนตัวเลข : "))
    # == 0 หมายความว่า 2 หารลงตัว
    if number % 2 == 0:
        print(number," เป็นเลขคู่")
    else :
        print(number," เป็นเลขขี้")
    '''


    # -------------------------------------------------------------------------------------------------------------------


    # Python Method Srting
    print("# Python Method Srting")

    '''
    # การเข้าถึงข้อมูล ..

    name = "watcharapol"
    name1 = "    Watcharapol    "
    name2 = "watcharapol phongwilai"

    #  name[ (Index จุดเริ่มต้น) : (Index จุดสุดท้าย) ] และ ถ้าไม่กำหนดหลัง ':' จะเอาจนถึงตำแหน่งตัวสุดท้าย
    #  name[ (index จำนวนเต็ม) : ] = นับจากหน้า ไปหลัง
    #  name[ : (index จำนวนติดลบ) ] = นับจากหลัง ไปหน้า

    # การรับค่า
    index = int(input("ตำแหน่องที่ index : "))  # 5

    print("index [", name1 ,"] ตำแหน่องที่ ",  index ," = ", name1[index])

    print("index [", name1 ,"] ตำแหน่องที่ ",  index ," = ", name1[ : index])

    print("index [", name1 ,"] ตำแหน่องที่ ",  index ," = ", name1[index : ])

    print("index [", name1 ,"] ตำแหน่องที่ ",  index , " = ", name1[index : 10])

    print("index [", name1 ,"] ตำแหน่องที่ ",  index ," = ", name1[index : -index])
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # len function .. 
    # แสดงค่าความยาวเป็น int

    lenname = len(name)
    print("\tแสดงค่าความยาว  = ",lenname,"  #  len() ใช้บอกค่าความยาวของ String")
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # strip function .. 
    # การลบช่องว่าง

    strip = name.strip()
    strip1 = name.lstrip()
    strip2 = name.rstrip()
    print(name," = ",len(strip),"   #  strip()  ใช้ลบช่องว่าง ซ้าย-ขวา")
    print(name," = ",len(strip1),"   #  lstrip() ลบช่องว่าง ทางซ้าย")
    print(name," = ",len(strip2),"   #  rstrip() ลบช่องว่าง ทางขวา")
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # case upper && lower function .. 
    # เปลี่ยนตัวอักษรเป็นพิมพ์ เล็ก-ใหญ่

    nameRstrip = name1.upper()
    nameLstrip = name1.lower()
    print(nameRstrip.rstrip(),"  # upper() เปลี่ยนตัวใหญ่")
    print(nameLstrip.lstrip(),"  # lower() เปลี่ยนเป็นตัวเล็ก")
    print("ค่าความยาว หลังใช้ rstrip()  = ",len(nameRstrip)," และ "," lstrip()  = ",len(nameLstrip))
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # capitalize function .. 
    # เปลี่ยนตัวอักษรตัวแรกสุด เป็นพิมพ์ใหญ่

    Upex = name1.capitalize()
    print(Upex," # capitalize() ทำให้ตัวแรกสุดเป็นตัวพิมพ์ใหญ่")
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # replace function .. 
    # การแก้ไขข้อมูล

    Rename1 = name1.replace("watcharapol","rushmi")
    print(Rename1," # replace() ใช้แปลี่ยนค่า เช่น .. replace( [ค่าเดิมที่ต้องการเปลี่ยน] , [ค่าที่จะใช้แทนที่ค่าเดิม] )")

    address = "บ้านเลขที่71 ถ.สุขุมวิท71 ปรีดีพนมยงค์71 เขตวัฒนา กรุุงเทพ "
    Readsress = address.replace("71", "21", 2)

    print(Readsress, " # ถ้าข้อมูลเดิมที่จะเปลี่ยนมีมากกว่า 1 replace( [ค่าเดิมที่ต้องการเปลี่ยน] , [ค่าที่จะใช้แทนที่ค่าเดิม] , [รพบุ .... ])")
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # check data function .. 
    # การเช็คข้อมูล

    data = "ยิ้มไม่ชอบกินผัก แต่ชอบกินผลไม้"
    print(data)

    yada = "ไม่ชอบ" in data    #  "[ข้อมูลหลักที่ต้องการค้นหา]" in [ข้อมูลหลักที่ต้องการค้นหา]

    if yada:
        data = data.replace("ไม่ชอบ","ชอบ",1)
        data1 = data.replace("แต่","และ")
        print(data," # ใช้เช็คข้อมูลว่ามีตรงกันหรือไม่")
        print(data1)
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # format function ..
    # format สามารถนำ ข้อมูลนึงมา แทรกในข้อความได้ โดยไม่ต้องใช้ ["" , +] พวกนี้ให้วุ่นวาย
    
    Fname = "วัชรพล"
    Lname = "พงษ์วิลัย"
    age = 1000

    text = "ชื่อ : {0}\tนามสกุล : {1}\tอายุ : {2}\tอาชีพ : {3}"    # แทรกในข้อความโดยการใช้ { ตำแหน่ง Index } จัดวาง Index ได้ตามต้องการ
    print(text.format(Fname,Lname,age,"นักซุ่มยิง"))            #  format( Index[0] , Index[1] , Index[2]  ) จะต้องนับเริ่มจาก 0 เสมอ
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # count funtion ..
    #  ใช้นับจำนวนคำ หรือ ข้อมูลอะไรก็ตาม จะได้ค่าออกมาเป็น จำนวนเต็มกลับมา

    datatext = "ฉันชอบกินกับข้าว ที่ฉันทำเอง เพราะคนอื่นทำกับข้าว ไม่ถูกปากฉัน"
    Count = datatext.count("ฉัน")     #  count( <สิ่งที่ต้องการนับ> )
    print(Count)
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # startswith && endswith function ..
    # startswith เป็นการเช็คข้อมูล ขึ้นต้นด้วย Index[0] มีค่าเป็น boolean
    # endswith เป็นการเช็คข้อมูล ตัวท้ายสุดด้วย Index[] มีค่าเป็น boolean

    datatext = "ไม้ วัชรพล"
    datatext1 = "186060"

    a = datatext.startswith("ไ")
    
    if a :
        print("เป็นชื่อเล่น")
    else:
        print("เป็นชื่อจริง")

    if datatext1.endswith("0"):
        print("ถูกรางวัล เลขท้าย 1ตัว")
    else:
        print("ถูกหวยแดก")
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    #  แปลงอุณหภูมิ ..

    temp = input("ป้อนอุณหภูมิ (องศา) : ")
    value = int(temp[: -1])
    unit = temp[-1].upper()  # C/F

    if unit == "C":
        result = ((value - 32)  * 5) / 9
        unit_result = "ฟาเรนไฮน์"
        print("แปลงค่า  ", temp, " เป็น ", result, "  ", unit_result)

    if unit  == "F":
        result =  ((9 * value) / 5) + 32
        unit_result = "เซลเซียส"
        print("แปลงค่า  ", temp, " เป็น ", result, " ", unit_result)

    else:
        print("จบ..")
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # for loop
    # for i in range(1,5,1)  == for(int i = 1; i < 5; i++)

    print("----------------------------------------------")
    for n in range(3):         # n เริ่มต้นด้วย index[0] จบที่ index[3]
        text1 = "[ หยุดที่ {0} ]  -> count "
        print(text1.format(n), n+1)

    print()
    for x in range(1,5):      # x เริ่มต้นด้วย index[1] จบที่ index[5]
        text2 = "[ start {0}, stop {1} ]  -> count "
        print(text2.format(x, x), x+1)

    print()
    for i in range(1,6,2):    # i เริ่มต้นด้วย index[1] จบที่ index[6] เพิ่มค่าทีละ 2
        text3 = "[ start {0}, stop {1}, add value {2} ]  -> count "
        print(text3.format(i,i,i),i+1)
    print("----------------------------------------------")

    print()
    for l in range(10,0,-1):
        text4 =  "[ start {0}, stop {1}, devalue {2} ]  -> count "
        print(text4.format(l,l,l),l+1)
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # for loop ซ้อน for loop

    for x in range(2,13):
        print()
        print("สูตรคูณแม่ที่ ", x)
        for y in range(1,13):
            print(x,'x',y," = ",(x*y))
    '''


    # -------------------------------------------------------------------------------------------------------------------


    '''
    # while loop ซ้อน for loop

     while True:
        x = input("ใส่ค่า : ")

        if x == '1':
            st = int(input("สูตรคูณแม่ที่...  : "))
            sp = int(input("สูตรคูณแม่สุดท้าย  : "))
            for x in range(st, sp+1):
                if x % 2 != 0:
                    continue  # ข้ามทำงาน
                print()
                print("สูตรคูณแม่ที่ ", x)
                for y in range(1, 13):
                    print(x, 'x', y, " = ", (x * y))

        elif x == '2':
            txt1 = "{0} ค่าที่ใส่ เพื่อหยุดการทำงาน loop"
            print(txt1.format(x))
            break  # หยุดการทำงาน
      '''


    # -------------------------------------------------------------------------------------------------------------------


    # ','  ลูกน้ำ ใช้เป็นตัวขั้นระหว่าง String กับ ชนิดข้อมูลอื่น
    # '+'  บวก  ใช้เชื่อม String กับ String จะเชื่อมกับ ชนิดข้อมูลอื่นไม่ได้
    # ตัวดำเนินการทางคณิตศาสตร์

    '''
    x = 10
    y = 5
    print("----------------")
    print("ผลบวก", x + y)
    print("----------------")
    print("ผลลบ", x - y)
    print("----------------")
    print("ผลคูณ", x * y)
    print("----------------")
    print("ผลหาร", x / y)
    print("----------------")
    print("หารปัดเศา", x // y)
    print("----------------")
    print("ยกกำลัง", x ** y)
    print("----------------")
    print("หารเอาเศษ", x % y)
    print("----------------")

    # print("fname : ")
    f = input("fname : ")
    # print("lname : ")
    l = input("lname : ")
    Fl = f + l
    print("your Name >> " + Fl)
    '''


# -------------------------------------------------------------------------------------------------------------------
