
from dataclasses import dataclass


if __name__ == "__main__":

    print("# Non Primitive : tuple ..\n")

    '''
    tuple เหมือนกับ list แต่ต่างกันตรงที่ไม่สามารถ เปรี่ยนแปลงข้อมูลภายในได้
    '''

    # ------------------------------------------------------------------------------------

    
    '''
    # tuple ..
    setdata1 = (1, 12, "อร่อย", False, 0.008, -5, True, 'C')
 
    # list ..
    setdata2 = [1, 12, "อร่อย", False, 0.008, -5, True, 'C']
    
    setdata1[2] = "ไม่อร่อย"
    setdata2[2] = "ไม่อร่อย" 
    
    print(type(setdata1), setdata1)
    print(type(setdata2), setdata2)
    '''


    # ------------------------------------------------------------------------------------


    '''
    # tuple การเข้าถึงข้อมูล ..
    # ถ้ามองจากฝั่งซ้าย เริ่มต้นที่ 0 || ถ้ามองจากฝั่งขวา เริ่มต้นที่ -1
    data1  = (5,"olo",True,'H',0.1," ",-10,False)
    
    print(data1[6] , data1[-1])
    '''

    
    # ------------------------------------------------------------------------------------
    
     
    '''
    # การแก้ไขข้อมูลใน tuple ..
    data  = (5, "olo", True, 'H', 0.1, " ", -10, False)
    print("ข้อมูลเดิม.. ", data)

    # นิยาม data จากที่เป็น tuple ให้เป็น list เพื่อแก้ไขข้อมูล
    lis = list(data)
    lis[0] = "หิวว่ะ.."
 
    # แก้ไขข้อมูลแล้วนิยาม data กลับมาเป็น tuple 
    tup = tuple(lis)
    print("แก้ไขข้อมูล.. ",tup)
    '''


    # ------------------------------------------------------------------------------------
    
     
    # การเข้าถึงข้อมูลด้วย loop ..
    data = ("cda", 65, True, 0.08, 'D', -1)

    for i in data:
        print("ข้อมูล = ",i)


    # ------------------------------------------------------------------------------------
